In [2]:
import pandas as pd
import csv

In [3]:
student_card = pd.DataFrame({'ID':[20190103, 20190222, 20190531],

                             'name':['Kim', 'Lee', 'Jeong'],

                             'class':['H', 'W', 'S']})

student_card

         ID   name class
0  20190103    Kim     H
1  20190222    Lee     W
2  20190531  Jeong     S

In [4]:
df = pd.DataFrame({'Mac':['big Mac', 'bacon tomato delux', 'quarter pound cheeze burger'], 'Burger king':['whopper', 'quatro cheeze whopper', 'diablo'], 'Price':[1000, 2000, 3000]})

In [5]:
df

                           Mac            Burger king  Price
0                      big Mac                whopper   1000
1           bacon tomato delux  quatro cheeze whopper   2000
2  quarter pound cheeze burger                 diablo   3000

In [6]:
df.to_csv("C:\\Users\\UserName\\Desktop\\2-2학기\\test.csv")##한글이 문제가 아니라 파일명을 지정해주지 않아서 오류뜬거였음음

In [7]:
dataset = pd.read_csv("C:/Users/UserName/Desktop/인공지능 개론/데이터 셋/mushrooms.csv")